{
  "slug": "card-sorting",
  "title": "Card Sorting",
  "duration": "1-2 weeks",
  "participants": "15-30 participants",
  "complexity": "Low",
  "purpose": "Understand how users categorize and organize information to inform navigation and content structure. Card sorting helps you design intuitive information architecture by learning how real customers group and label content.",
  "tools": [
    {
      "name": "Askable",
      "description": "Recruitment & Card Sorting Platform",
      "icon": "fa-users",
      "link": "https://app.askable.com/studies"
    },
    {
      "name": "Figma Slides",
      "description": "Insights Deck (Max 3 per piece of research)",
      "icon": "fa-presentation",
      "link": "https://www.figma.com/slides/RodMmoG77vJztZsM6Z3Ean/2025-Research-Playback?node-id=484-8400&t=2tZP1VJliVSeW8i6-1"
    }
  ],
  "steps": [
    {
      "title": "Understand when to use card sorting",
      "description": "Card sorting is your go-to method when you need to organize content in a way that makes sense to customers, not just to the bank. It's particularly powerful when you're dealing with complex information structures.\n\nPerfect for:\n- Organizing product categories (savings, loans, cards, insurance)\n- Structuring help content and FAQs\n- Designing navigation menus\n- Grouping account settings and features\n- Organizing financial tools and calculators\n\nThere are two types:\n1. Open card sort - Participants create their own categories\n2. Closed card sort - Participants sort into pre-defined categories\n\nFor banking, open sorts work brilliantly when you're starting fresh or redesigning. Closed sorts are great for validating existing structures or adding new features to established categories.\n\nThings to remember:\n- Card sorting shows you HOW people group things, not IF they'll find them\n- Follow up with tree testing to validate the findability\n- Cultural and demographic differences matter - what makes sense to young professionals might confuse retirees",
      "screenshot": "",
      "screenshots": []
    },
    {
      "title": "Prepare your cards",
      "description": "This is the foundation of your study. Get this wrong and your whole sort will be off.\n\nStart by listing all the content/features you need to organize. For a banking app, this might include:\n- Account types (everyday, savings, term deposits)\n- Transactions and payments\n- Cards and card controls\n- Security settings\n- Profile information\n- Tools (calculators, goal trackers)\n- Help topics\n\nCard writing tips:\n- Use customer language, not bank jargon (\"Send money\" not \"Initiate transfer\")\n- Keep cards consistent in detail level (don't mix \"Savings account\" with \"Fixed term deposit with bonus interest rate for balances over $10,000\")\n- Aim for 30-60 cards max - more becomes overwhelming\n- Include a few cards you're unsure about - they often reveal interesting patterns\n\nThings to avoid:\n- Don't use current menu names as cards\n- Don't include cards that obviously go together (\"Username\" and \"Password\")\n- Don't write leading cards that suggest their category\n\nTest your cards with a colleague first. If they're confused, customers will be too.",
      "screenshot": "",
      "screenshots": []
    },
    {
      "title": "Set up your Askable study",
      "description": "1. Log into Askable and look for the card sorting template (it should be one of the study types available). Duplicate it and name your study clearly, like \"Ubank Navigation Card Sort - [Date]\".\n\n2. Configure your card sort settings:\n- Choose Open or Closed sort\n- Add all your cards (copy and paste from your prepared list)\n- For closed sorts, define your categories\n- Set instructions that explain the context\n\n3. Write clear instructions for participants:\n\"Imagine you're using your banking app. Group these features and tools in a way that makes sense to you. There are no right or wrong answers - we want to understand your mental model.\"\n\n4. Add screening questions to get the right participants:\n- Current banking app usage (daily/weekly/monthly)\n- Age range (to ensure diverse perspectives)\n- Primary banking activities\n- Tech confidence level\n\nRemember:\n- Submit before 3pm for same-day approval\n- Allow 5-7 days for recruitment and completion\n- Consider running separate sorts for different user segments",
      "screenshot": "",
      "screenshots": []
    },
    {
      "title": "Run the card sort",
      "description": "Once your study is live and approved, monitor it closely for the first few participants.\n\nEarly checks:\n- Are participants creating sensible groups?\n- Is anyone creating too many categories (might indicate cards are too granular)?\n- Are there cards everyone struggles to place?\n\nCommon issues in banking card sorts:\n- \"Payments\" vs \"Transfers\" confusion - customers often see these as the same\n- Security features scattered across multiple groups\n- Tool/calculator cards that don't fit anywhere\n\nIf you spot major issues early:\n- You can pause and adjust\n- Add clarification to problematic cards\n- Consider removing truly confusing cards\n\nLet the study run for 5-7 days. You want at least 15 completed sorts for reliable patterns. Askable will handle all the participant management and data collection.\n\nPro tip: Take notes on interesting category names participants create - these often become great navigation labels.",
      "screenshot": "",
      "screenshots": []
    },
    {
      "title": "Analyze the results",
      "description": "Askable provides analysis tools, but here's how to make sense of the data:\n\n1. Look for strong agreement:\n- Cards that 80%+ participants put in the same category are your anchors\n- These form the core of each navigation section\n\n2. Identify problem cards:\n- Cards with low agreement (<40%) need special attention\n- These might need different labels or multiple access points\n\n3. Analyze category names (for open sorts):\n- Look for patterns in what participants call groups\n- \"Money stuff\" might become \"Payments & transfers\"\n- Use their language where possible\n\n4. Check for mental model differences:\n- Do younger users group differently than older ones?\n- Are there cultural differences in categorization?\n\nFor banking specifically, watch for:\n- Whether users separate \"spending\" from \"saving\" activities\n- How they think about security (separate section or integrated?)\n- If they distinguish between \"managing money\" and \"help/support\"\n\nDocument patterns, not just percentages. \"Users consistently grouped all card-related features together, including card controls, PIN changes, and replacement requests\" is more useful than raw numbers.",
      "screenshot": "",
      "screenshots": []
    },
    {
      "title": "Create your information architecture",
      "description": "Now comes the art - turning data into design. You're not just copying what users did, you're using their mental models to inform a structure that works for everyone.\n\nStart with the strong patterns:\n- Groups with high agreement become main navigation items\n- Consistent category names inform your labels\n- Problem cards might need multiple entry points\n\nFor a banking app, you might see:\n- \"Accounts\" (all account types, balances, statements)\n- \"Move money\" (pay, transfer, scheduled payments)\n- \"Cards\" (physical and digital cards, controls)\n- \"Help & support\" (FAQs, contact, guides)\n- \"Profile & settings\" (personal info, security, preferences)\n\nHandle edge cases:\n- Put ambiguous items in multiple places\n- Use \"See also\" links for related features\n- Consider progressive disclosure for complex features\n\nRemember:\n- Business requirements still matter (regulatory items might need prominence)\n- Technical constraints exist (some groupings might not be feasible)\n- You're designing for findability, not just logical grouping\n\nCreate a simple sitemap showing your proposed structure. This becomes your blueprint for tree testing validation.",
      "screenshot": "",
      "screenshots": []
    },
    {
      "title": "Document insights",
      "description": "Your insights deck should tell the story of how customers think about your product's organization.\n\nStructure your presentation:\n\n1. Key insight: Start with the big picture\n\"Customers organize banking features by frequency of use, not by product type. Daily tasks like checking balances and making payments need to be separate from occasional tasks like updating details.\"\n\n2. Supporting patterns:\n- Show the strongest groupings with percentages\n- Highlight surprising findings\n- Include quotes about category names\n\n3. Recommendations with rationale:\n\"Combine 'Transfers' and 'Payments' into 'Move money' - 87% of participants grouped these together and couldn't articulate a difference.\"\n\nThings to include:\n- Visual representation of the most common groupings\n- Problem cards and how to handle them\n- Proposed navigation structure\n- Next steps (usually tree testing to validate)\n\nRemember: You're not just reporting what happened, you're translating user mental models into design decisions. Make it clear why each recommendation will improve the customer experience.\n\nAlways end with clear next steps - usually validating your new structure with tree testing.",
      "screenshot": "",
      "screenshots": []
    }
  ]
}