{
  "slug": "heuristic-analysis",
  "title": "Heuristic Analysis",
  "duration": "2-3 Days",
  "participants": "2-3 Designers",
  "complexity": "Low",
  "purpose": "A heuristic analysis is primarily used to provide a point of reference for comparison in future versions of your design. This task is best completed during your discovery phase, right as you start working on the project, because it can also be used to help you understand the current state problems in more detail.\n\nA heuristic analysis can be conducted as a group within the design team for your project.",
  "tools": [
    {
      "name": "Figma Slides",
      "description": "Insights Deck (Max 3 per piece of research)",
      "icon": "fa-presentation",
      "link": "https://www.figma.com/slides/RodMmoG77vJztZsM6Z3Ean/2025-Research-Playbook?node-id=484-8400&t=2tZP1VJliVSeW8i6-1"
    },
    {
      "name": "Askable",
      "description": "Recruitment and moderation",
      "icon": "fa-users",
      "link": ""
    }
  ],
  "steps": [
    {
      "title": "Define the scope",
      "description": "Think of heuristic analysis as getting a fresh pair of experienced eyes on your design. It's not user testing - you won't learn what real customers think. Instead, you're checking if your design follows proven usability principles.\n\nIt's brilliant for:\n- Catching obvious issues before user testing\n- Getting quick feedback when you're too close to the design\n- When you don't have time/budget for user research\n\nIt won't tell you:\n- If customers will actually use a feature\n- If your business logic makes sense\n- How real users behave\n\nThe beauty? You can do it in a couple of days with just your design team."
    },
    {
      "title": "Add Your Screens",
      "description": "Using Figjam, (in link above) your job at this step is to add one screenshot for every screen that you are testing, which should correlate to your screen goals. Every screen you add has a screen goal, and every screen goal has a screenshot of that screen so that people documenting feedback can note down the feedback.\n\nAn example of this could be you start a user on the home page, you might not add a screenshot for that, as you're not looking to collect any feedback on that home page component."
    },
    {
      "title": "Use Figma FigJam",
      "description": "I have created some templates for you to duplicate for your studies, for user testing, this one will be the first one in the list.\nPress the three dots on the right side of the screen and then press duplicate, name your study appropriately and you can get started.\n\nYou can see the second screenshot that I have uploaded is the recruit page. I recommend that the first thing you do is start thinking about who you want to run the study with. Again, I have uploaded some default questions that will get you started, but your goal here is to add custom screening questions that target the specific people you want to test with.\n\nConsiderations\n- Askable mandates that you need to have at least a few screener questions, they don't like it when we leave these blank and will block your study from going live.\n- If you want to go live with your study that day, make sure you go live with it at the latest before 3 pm, to have a chance for Askable to approve it before the end of the day. I will have a guide on what kind of screener questions you can ask."
    },
    {
      "title": "Create Test Scenarios",
      "description": "Test scenarios are the backbone of your heuristic evaluation. They're user-focused situations that help evaluators understand the context in which users would interact with your design.\n\nA good test scenario:\n- Is based on a real user goal or task\n- Provides sufficient context without being leading\n- Allows evaluators to walk through the user journey step-by-step\n- Covers the key flows you want to evaluate\n\nScenario Example:\n\"You're a small business owner who needs to transfer $5,000 to pay a supplier. You've logged into your banking app and need to complete this payment today. Walk through how you would accomplish this task.\"\n\nNot: \"Click on the transfer button and send money\" (too prescriptive)\nNot: \"Use the banking app\" (too vague)\n\nCreate 3-5 scenarios that cover your main user journeys. Each scenario should take 10-15 minutes to evaluate."
    },
    {
      "title": "Set up Askable Study",
      "description": "I have created some templates for you to duplicate for your studies, for user testing, this one will be the first one in the list.\nPress the three dots on the right side of the screen and then press duplicate, name your study appropriately and you can get started.\n\nYou can see the second screenshot that I have uploaded is the recruit page. I recommend that the first thing you do is start thinking about who you want to run the study with. Again, I have uploaded some default questions that will get you started, but your goal here is to add custom screening questions that target the specific people you want to test with.\n\nConsiderations\n- Askable mandates that you need to have at least a few screener questions, they don't like it when we leave these blank and will block your study from going live.\n- If you want to go live with your study that day, make sure you go live with it at the latest before 3 pm, to have a chance for Askable to approve it before the end of the day. I will have a guide on what kind of screener questions you can ask."
    },
    {
      "title": "Accepting Participants into the Study - Join Testing Sessions",
      "description": "When you create your study and launch it.\n\nYou will periodically need to check back in and accept participants into the study. When you do this, each participant will get a link. This is the link that you will click on when you are ready to join your sessions.\n\nThere will also be a link that you can click on, which will be for your moderators the people who are helping you take notes.\nThings to consider\n- Be careful not to share the facilitator link with your moderators.\n- When moderators are joining your sessions, be careful when you accept them, as it doesn't always work, they will need to reload their page and you will need to approve them into the study again. (there is a small glitch in askable) You can tell when someone has successfully joined when you are in the session, though."
    },
    {
      "title": "Assigning Participants into the Study - Join Testing Sessions",
      "description": "You have a few options, but the key one for an unmoderated test you will use is the top one \"Prototype test\" and the \"Open Answer\" or the \"Multiple Choice\"\n\nPrototype Test - to add your scenarios, remember one of these per question, one of these per task, if you have 5 task that means you will do this 5 times.\nOpen Answer - to validate with users anything else they want to share with us.\nMuliple choice - Can be used to measure feelings, or follow up questions etc"
    },
    {
      "title": "Adding another block",
      "description": "You have a few options, but the key one for an unmoderated test you will use is the top one \"Prototype test\" and the \"Open Answer\" or the \"Multiple Choice\"\n\nPrototype Test - to add your scenarios, remember one of these per question, one of these per task, if you have 5 task that means you will do this 5 times.\nOpen Answer - to validate with users anything else they want to share with us.\nMuliple choice - Can be used to measure feelings, or follow up questions etc"
    },
    {
      "title": "Document Insights",
      "description": "Arguably one of the most important steps of the entire process, producing your presentation at the end of your study is the vessel to help your stakeholders understand where you are at with the design, concept, etc etc. The goal of this presentation is to share insights, not present raw data about pass and fail.\n\nTo write an effective insight, you will need to process your testing results, consider their implications, and then think through how to communicate this to your stakeholders.\nAn example of a good insight: \"People want to see the details of their payment immediately after making the payment.\"\nAn example of a not so good insight: \"Of the 100 people surveyed, 94% had used a rewards or loyalty offer in the past 6 months. Interestingly 45% of participants said the rewards offers made them spend more than they normally would.\"\n\nYou can see in the \"not so good\" insight that it requires the reader to process the result and discover meaning from that result. This is the job of your insights, to have done that processing for the reader and be able to share the \"so what\" so they can take your insight and be able to make a decision based on it.\n\nPlease aim for no more than 3 insights per slide deck, you want to summarise the test into a maximum of 3 key takeaways that your audience can take and action."
    }
  ]
}